taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F1xx_DFP.2.2.0.pdsc
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32F1xx CMSIS">
      <description>System Startup for STMicroelectronics STM32F1xx device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device/Include/"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device/Source/ARM/STM32F1xx_OPT.s"           attr="template"  condition="Compiler ARM" select="Flash Option Bytes Template"/>

        <!-- startup files -->
        <file category="source" name="Device/Source/ARM/startup_stm32f10x_ld_vl.s" attr="config" version="1.0.0" condition="STM32F1xx VL LD ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_stm32f10x_md_vl.s" attr="config" version="1.0.0" condition="STM32F1xx VL MD ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_stm32f10x_hd_vl.s" attr="config" version="1.0.0" condition="STM32F1xx VL HD ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_stm32f10x_ld.s"    attr="config" version="1.0.0" condition="STM32F1xx LD ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_stm32f10x_md.s"    attr="config" version="1.0.0" condition="STM32F1xx MD ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_stm32f10x_hd.s"    attr="config" version="1.0.0" condition="STM32F1xx HD ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_stm32f10x_xl.s"    attr="config" version="1.0.0" condition="STM32F1xx XL ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_stm32f10x_cl.s"    attr="config" version="1.0.0" condition="STM32F1xx CL ARMCC"/>

        <!-- system file -->
        <file category="source" name="Device/Source/system_stm32f10x.c"            attr="config" version="1.0.0" />
        <!-- device configuration required by drivers at the moment -->
        <file category="header" name="RTE_Driver/Config/RTE_Device.h"              attr="config" version="1.1.2"/>
      </files>
    </component>

    <!-- START: STMicroelectronics Standard Peripherals Drivers -->

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="3.5.1" condition="STM32F1xx STDPERIPH">
      <description>Standard Peripherals Drivers Framework</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
      </RTE_Components_h>
      <files>
        <file category="doc"     name="Device/StdPeriph_Driver/stm32f10x_stdperiph_lib_um.chm"/>
        <file category="include" name="Device/StdPeriph_Driver/inc/"/>
        <file category="header"  name="Device/StdPeriph_Driver/inc/misc.h"/>
        <file category="source"  name="Device/StdPeriph_Driver/src/misc.c"/>
        <file category="source"  name="Device/StdPeriph_Driver/templates/stm32f10x_conf.h" attr="config" version="3.5.0"/>
        <file category="header"  name="Device/StdPeriph_Driver/templates/stm32f10x_it.h"   attr="template" select="Interrupt Service Routines"/>
        <file category="source"  name="Device/StdPeriph_Driver/templates/stm32f10x_it.c"   attr="template" select="Interrupt Service Routines"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Analog-to-digital converter (ADC) driver for STM32F10x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_adc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_adc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BKP" Cversion="3.5.0" condition="STM32F1xx STDPERIPH">
      <description>Backup registers (BKP) driver for STM32F10x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BKP
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_bkp.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_bkp.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Controller area network (CAN) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_can.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_can.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CEC" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Consumer electronics control controller (CEC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CEC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_cec.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_cec.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="3.5.0" condition="STM32F1xx STDPERIPH ">
      <description>CRC calculation unit (CRC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_crc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_crc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Digital-to-analog converter (DAC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_dac.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_dac.c"/>
      </files>
    </component>

